# YOLOv9-C (VOC) + CBAMRes (ONE-POINT, CORE BOTTLENECK ONLY)
# - Only insert CBAMRes once: after SPPELAN (P5 aggregated bottleneck)
# - Main branch: no more CBAMRes on P3/P4/P5 heads
# - PGI branch: unchanged, no CBAMRes
# - DualDDetect inputs updated: [PGI(P3,P4,P5), Main(P3,P4,P5)]

nc: 20
depth_multiple: 1.0
width_multiple: 1.0
anchors: 3

backbone:
  [
    [-1, 1, Silence, []],                         # 0

    [-1, 1, Conv, [64, 3, 2]],                     # 1 - P1/2
    [-1, 1, Conv, [128, 3, 2]],                    # 2 - P2/4
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],      # 3
    [-1, 1, ADown, [256]],                         # 4 - P3/8
    [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],     # 5
    [-1, 1, ADown, [512]],                         # 6 - P4/16
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 7
    [-1, 1, ADown, [512]],                         # 8 - P5/32
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 9
  ]

head:
  [
    # ------------------------------
    # main neck/head (ONLY ONE CBAMRes)
    # ------------------------------
    [-1, 1, SPPELAN, [512, 256]],                  # 10
    [-1, 1, CBAMRes, []],                # 11  (ONLY here)

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 12
    [[-1, 7], 1, Concat, [1]],                     # 13 (P5 -> P4 fuse)
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 14

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 15
    [[-1, 5], 1, Concat, [1]],                     # 16 (P4 -> P3 fuse)
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],     # 17 (Main P3)

    [-1, 1, ADown, [256]],                         # 18 (P3 -> P4 down)
    [[-1, 14], 1, Concat, [1]],                    # 19 (concat head P4)
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 20 (Main P4)

    [-1, 1, ADown, [512]],                         # 21 (P4 -> P5 down)
    [[-1, 11], 1, Concat, [1]],                    # 22 (concat head P5 agg)
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 23 (Main P5)

    # ------------------------------
    # multi-level reversible auxiliary branch (PGI) [UNCHANGED]
    # ------------------------------
    # routing
    [5, 1, CBLinear, [[256]]],                     # 24
    [7, 1, CBLinear, [[256, 512]]],                # 25
    [9, 1, CBLinear, [[256, 512, 512]]],           # 26

    # conv down
    [0, 1, Conv, [64, 3, 2]],                      # 27 - P1/2
    [-1, 1, Conv, [128, 3, 2]],                    # 28 - P2/4
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],      # 29

    # avg-conv down fuse
    [-1, 1, ADown, [256]],                         # 30 - P3/8
    [[24, 25, 26, -1], 1, CBFuse, [[0, 0, 0]]],    # 31
    [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],     # 32 (PGI P3)

    [-1, 1, ADown, [512]],                         # 33 - P4/16
    [[25, 26, -1], 1, CBFuse, [[1, 1]]],           # 34
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 35 (PGI P4)

    [-1, 1, ADown, [512]],                         # 36 - P5/32
    [[26, -1], 1, CBFuse, [[2]]],                  # 37
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 38 (PGI P5)

    # detect: [PGI P3,P4,P5,  Main P3,P4,P5]
    [[32, 35, 38, 17, 20, 23], 1, DualDDetect, [nc]],  # 39
  ]
