# YOLOv9-C (VOC) + ECA (main neck only, skip BiFPN)
# - 恢复 neck 融合为 Concat
# - 在主分支 head/neck 的关键块后插入 ECA（不改变通道）
# - PGI 辅助分支结构保持不变（但因插层整体索引后移，已同步修正引用）

# parameters
nc: 20
depth_multiple: 1.0
width_multiple: 1.0
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
    [-1, 1, Silence, []],                         # 0

    [-1, 1, Conv, [64, 3, 2]],                     # 1 - P1/2
    [-1, 1, Conv, [128, 3, 2]],                    # 2 - P2/4
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],      # 3
    [-1, 1, ADown, [256]],                         # 4 - P3/8
    [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],     # 5
    [-1, 1, ADown, [512]],                         # 6 - P4/16
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 7
    [-1, 1, ADown, [512]],                         # 8 - P5/32
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 9
  ]

# YOLOv9 head
head:
  [
    # ------------------------------
    # main neck/head (with ECA)
    # ------------------------------
    [-1, 1, SPPELAN, [512, 256]],                  # 10
    [-1, 1, ECA, []],                              # 11  (ECA after SPPELAN)

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 12
    [[-1, 7], 1, Concat, [1]],                     # 13  (P5 -> P4 fuse, concat backbone P4)
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 14
    [-1, 1, ECA, []],                              # 15  (ECA)

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 16
    [[-1, 5], 1, Concat, [1]],                     # 17  (P4 -> P3 fuse, concat backbone P3)
    [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],     # 18  (P3/8-small)
    [-1, 1, ECA, []],                              # 19  (ECA on P3)

    [-1, 1, ADown, [256]],                         # 20  (P3 -> P4 down)
    [[-1, 15], 1, Concat, [1]],                    # 21  (concat head P4)
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 22  (P4/16-medium)
    [-1, 1, ECA, []],                              # 23  (ECA on P4)

    [-1, 1, ADown, [512]],                         # 24  (P4 -> P5 down)
    [[-1, 11], 1, Concat, [1]],                    # 25  (concat head P5)
    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 26  (P5/32-large)
    [-1, 1, ECA, []],                              # 27  (ECA on P5)

    # ------------------------------
    # multi-level reversible auxiliary branch (PGI) [STRUCTURE UNCHANGED]
    # (indices shifted due to ECA layers above)
    # ------------------------------

    # routing
    [5, 1, CBLinear, [[256]]],                     # 28
    [7, 1, CBLinear, [[256, 512]]],                # 29
    [9, 1, CBLinear, [[256, 512, 512]]],           # 30

    # conv down
    [0, 1, Conv, [64, 3, 2]],                      # 31 - P1/2
    [-1, 1, Conv, [128, 3, 2]],                    # 32 - P2/4
    [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],      # 33

    # avg-conv down fuse
    [-1, 1, ADown, [256]],                         # 34 - P3/8
    [[28, 29, 30, -1], 1, CBFuse, [[0, 0, 0]]],    # 35

    [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],     # 36

    [-1, 1, ADown, [512]],                         # 37 - P4/16
    [[29, 30, -1], 1, CBFuse, [[1, 1]]],           # 38

    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 39

    [-1, 1, ADown, [512]],                         # 40 - P5/32
    [[30, -1], 1, CBFuse, [[2]]],                  # 41

    [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],     # 42

    # detect
    [[36, 39, 42, 19, 23, 27], 1, DualDDetect, [nc]],  # 43 (A3,A4,A5,P3,P4,P5)
  ]
